package Lessons.lesson11
//
//Напишите сигнатуру метода в которую входит модификатор доступа, название функции, список аргументов с типами и возвращаемое значение. В теле метода можешь сделать возврат объекта нужного типа если это требуется для устранения ошибок.
//
private fun fun_1(a: Int, b: Int): Int{
    return (a+b)
}
//Не принимает аргументов и не возвращает значения.
fun fun_2(){
}
//Принимает два целых числа и возвращает их сумму.
fun fun_3(a: Int, b: Int): Int{
    return (a+b)
}
//Принимает строку и ничего не возвращает.
fun fun_4(a: String){
}
//Принимает список целых чисел и возвращает среднее значение типа Double.
fun fun_5(numbers: List<Int>): Double {
    return numbers.average()
}
//Принимает nullable строку и возвращает её длину в виде nullable целого числа и доступна только в текущем файле.
private fun fun_6(a: String?): Int?{
}

//Не принимает аргументов и возвращает nullable вещественное число.
fun fun_7(): Double?{

}
//Принимает nullable список целых чисел, не возвращает значения и доступна только в текущем файле.
private fun fun_8(a: List<Int>?) {

}
//Принимает целое число и возвращает nullable строку.
fun fun_9(a: Int): String?{
}
//Не принимает аргументов и возвращает список nullable строк.
fun fun_10(): List<String?>
//Принимает nullable строку и nullable целое число и возвращает nullable булево значение.
fun fun_11(a: String?, b: Int?): Boolean?




//Задачи на написание кода
//Напишите валидную сигнатуру метода а так же рабочий код для задач.

//Напишите функцию multiplyByTwo, которая принимает целое число и возвращает его, умноженное на 2.
fun multiplyByTwo(a: Int): Int = a * 2
//Создайте функцию isEven, которая принимает целое число и возвращает true, если число чётное, и false в противном случае.
fun isEven(a: Int): Boolean = a % 2 == 0
//Напишите функцию printNumbersUntil, которая принимает целое число n и выводит на экран числа от 1 до n. Если число n меньше 1, функция должна прекратить выполнение с помощью return без вывода сообщений.
fun printNumbersUntil(n: Int){
    if (n < 1) return
    for (i in 1..n) {
        println(i)
    }
}

fun findFirstNegative(a: List<Int>): Int?{
    for ( i in a){
        if ( i < 0) return i
    }
    return null
}
//Напишите функцию processList, которая принимает список строк. Функция должна проходить по списку и выводить каждую строку. Если встречается null значение, функция должна прекратить выполнение с помощью return без возврата значения.
fun processList(a: List<String?>){
    for ( i in a){
        if(i == null) return
        println (i)
    }
}